# Pandas
- pandas是一个功能强大的python包，用于分析时间序列以及大小数据集
- pandas可以简单直观地处理关系型和标记型数据
- pandas类似于电子表格，常用于真实世界的高级数据分析

## Pandas数据类型
- 一维Series
- 二维DataFrame

![](img/base_01_pandas_5_0.png)

In [23]:
import numpy as np
import pandas as pd
pd.__version__

'1.5.3'

## 1. Series

In [2]:
# 普通列表
subjects = ["军训", "思修", "史纲", "马原", "毛概", "体育1", "体育2"]
score = [65, 80, 75, 83, 77, 100, 98]
print(subjects)
print(score)

['军训', '思修', '史纲', '马原', '毛概', '体育1', '体育2']
[65, 80, 75, 83, 77, 100, 98]

In [3]:
#把列表转化为Series
s1 = pd.Series(subjects)
type(s1)

pandas.core.series.Series

In [4]:
# 构造Series
s2 = pd.Series(score, name="score")
print(s1)
print(s2)

0     军训
1     思修
2     史纲
3     马原
4     毛概
5    体育1
6    体育2
dtype: object
0     65
1     80
2     75
3     83
4     77
5    100
6     98
Name: score, dtype: int64

In [10]:
s1[0:4]

0    军训
1    思修
2    史纲
3    马原
dtype: object

## 2. DataFrame

In [5]:
# 把两个Series合并为一个字典，然后创建DataFrame
df = pd.DataFrame({'Subjects': s1, 'Score': s2})
df

  Subjects  Score
0       军训     65
1       思修     80
2       史纲     75
3       马原     83
4       毛概     77
5      体育1    100
6      体育2     98

### 2.1 读取数据以及基础操作
一般英文数据的csv文件读取没什问题。
- `pd.read_csv(filepath, skiprows= , encoding=None)`  读取csv文件
- `pd.read_excel(filepath, encoding=None)` 读取xls、xlsx文件
- `pd.read_table(filepath, sep=',', nrows=, comment=',', encoding=None)` 读取txt文件

**参数解读**
- `filepath`  待读取文件路径
- `encoding`   文件编码方式主要是utf-8、gbk。如果不知道编码方式，可以结合chardet库 (参考Python常见错误)
- `comment`  在`comment`字符(,)后面的部分将被看作注释
- `skiprows`  读取文件时跳过文件开头的行数
- `nrows`  读取文件的行数
- `header`  
- `names`  对列（列索引）的命名

In [42]:
# 读取csv文件，直接得到DataFrame
df = pd.read_csv('data/score.csv', encoding='gbk')
df

      subject  year  score  credits property
0    程序设计基础A6  2019   96.0        1       任选
1      机械制图D5  2018   79.0        4       任选
2    程序设计基础B3  2016  100.0        5       必修
3       微积分C1  2016   65.0        3       必修
4       微积分A8  2015   85.0        5       必修
..        ...   ...    ...      ...      ...
96     大学物理A6  2016   82.0        1       限选
97   程序设计基础D5  2016   62.0        2       限选
98      微积分D6  2019   86.0        3       限选
99   电工电子技术C2  2015   66.0        4       任选
100  程序设计基础B4  2015   61.0        4       限选

[101 rows x 5 columns]

In [7]:
df.head()#查看数据的前几行

    subject  year  score  credits property
0  程序设计基础A6  2019   96.0        1       任选
1    机械制图D5  2018   79.0        4       任选
2  程序设计基础B3  2016  100.0        5       必修
3     微积分C1  2016   65.0        3       必修
4     微积分A8  2015   85.0        5       必修

In [8]:
df.tail()#查看数据的最后几行

      subject  year  score  credits property
96     大学物理A6  2016   82.0        1       限选
97   程序设计基础D5  2016   62.0        2       限选
98      微积分D6  2019   86.0        3       限选
99   电工电子技术C2  2015   66.0        4       任选
100  程序设计基础B4  2015   61.0        4       限选

In [9]:
df.describe()#一键查看数据描述

              year       score     credits
count   101.000000   97.000000  101.000000
mean   2017.326733   80.206186    3.178218
std       1.721098   13.476011    1.499307
min    2015.000000   55.000000    1.000000
25%    2016.000000   68.000000    2.000000
50%    2017.000000   81.000000    3.000000
75%    2019.000000   91.000000    5.000000
max    2020.000000  100.000000    5.000000

In [10]:
df['year'].unique()#某个Series的值有多少种

array([2019, 2018, 2016, 2015, 2020, 2017], dtype=int64)

In [11]:
df['year'].nunique()#某个Series的值有哪些

6

In [12]:
df['year'].value_counts()#统计Series中各个元素数量

2015    20
2019    19
2016    19
2018    15
2017    15
2020    13
Name: year, dtype: int64

### 常规操作：索引与切片、增删查改、排序

- 按列索引 df['Series_Name']
- 按列索引 df.iloc[2]
- 按照逻辑判断值索引

 还可以选择多行、选择多列、选择特定列、选择单个值、选择部分值……

In [27]:
#按列检索
df['subject']

0      程序设计基础A6
1        机械制图D5
2      程序设计基础B3
3         微积分C1
4         微积分A8
         ...
96       大学物理A6
97     程序设计基础D5
98        微积分D6
99     电工电子技术C2
100    程序设计基础B4
Name: subject, Length: 101, dtype: object

In [22]:
#怎样检索多列？
df[['subject','property']]

      subject property
0    程序设计基础A6       任选
1      机械制图D5       任选
2    程序设计基础B3       必修
3       微积分C1       必修
4       微积分A8       必修
..        ...      ...
96     大学物理A6       限选
97   程序设计基础D5       限选
98      微积分D6       限选
99   电工电子技术C2       任选
100  程序设计基础B4       限选

[101 rows x 2 columns]

In [15]:
#按行检索
df.iloc[2]

subject     程序设计基础B3
year            2016
score          100.0
credits            5
property          必修
Name: 2, dtype: object

In [43]:
#检索连续多行
df.iloc[2:5]

    subject  year  score  credits property
2  程序设计基础B3  2016  100.0        5       必修
3     微积分C1  2016   65.0        3       必修
4     微积分A8  2015   85.0        5       必修

In [44]:
df.loc[2:5]

    subject  year  score  credits property
2  程序设计基础B3  2016  100.0        5       必修
3     微积分C1  2016   65.0        3       必修
4     微积分A8  2015   85.0        5       必修
5      体育A2  2020   86.0        2       必修

In [31]:
#检索不连续多行?， 例如，检索第2～5行，7～12行，和第15行
df.iloc[[1,2,3,4,6,7,8,9,10,11,14]]

     subject  year  score  credits property
1     机械制图D5  2018   79.0        4       任选
2   程序设计基础B3  2016  100.0        5       必修
3      微积分C1  2016   65.0        3       必修
4      微积分A8  2015   85.0        5       必修
6     机械制图B4  2017   62.0        3       限选
7   电工电子技术D4  2016   57.0        5       必修
8   电工电子技术C6  2019   89.0        2       任选
9   电工电子技术C7  2020    NaN        5       必修
10    大学物理A2  2015   94.0        5       限选
11  程序设计基础A8  2017   97.0        4       限选
14  程序设计基础D4  2019   61.0        5       任选

In [32]:
# 排序,默认按照升序排列
df = df.sort_values(by="score", ascending=True)
df

     subject  year  score  credits property
71  程序设计基础D5  2016   55.0        3       限选
86     微积分C5  2016   56.0        5       任选
57  程序设计基础A5  2015   57.0        2       任选
7   电工电子技术D4  2016   57.0        5       必修
45    机械制图D8  2017   58.0        2       限选
..       ...   ...    ...      ...      ...
77      体育B7  2019  100.0        5       必修
9   电工电子技术C7  2020    NaN        5       必修
37    大学物理B3  2018    NaN        3       必修
54    机械制图B3  2019    NaN        4       必修
63    线性代数D7  2018    NaN        4       任选

[101 rows x 5 columns]

### loc()和iloc()函数
- DataFrame.loc[行标签,列标签]
- DataFrame.iloc[行位置,列位置]

In [39]:
df.loc[7]

subject     电工电子技术D4
year            2016
score           57.0
credits            5
property          必修
Name: 7, dtype: object

In [40]:
df.iloc[2]

subject     程序设计基础A5
year            2015
score           57.0
credits            2
property          任选
Name: 57, dtype: object

In [41]:
df.iloc[2:5]

     subject  year  score  credits property
57  程序设计基础A5  2015   57.0        2       任选
7   电工电子技术D4  2016   57.0        5       必修
45    机械制图D8  2017   58.0        2       限选

### 查看是否有缺失值
- df.isna()  nan所在的位置返回True，正常数据返回False
- df.notna()  df.isna()反向操作

###  缺失项处理

- df.dropna(axis, inplace)  默认axis=0 #axis=1，当该列全部数据都不是nan时，该列保留。
df.dropna(axis=1)
- df.fillna(某个数or定义的字典, inplace)  填充


上述两种缺失值操作都有inplace参数可供使用

In [19]:
df.isna()

    subject   year  score  credits  property
71    False  False  False    False     False
86    False  False  False    False     False
57    False  False  False    False     False
7     False  False  False    False     False
45    False  False  False    False     False
..      ...    ...    ...      ...       ...
77    False  False  False    False     False
9     False  False   True    False     False
37    False  False   True    False     False
54    False  False   True    False     False
63    False  False   True    False     False

[101 rows x 5 columns]

In [20]:
df = df.dropna() # 去除有缺失值的项
df

     subject  year  score  credits property
71  程序设计基础D5  2016   55.0        3       限选
86     微积分C5  2016   56.0        5       任选
57  程序设计基础A5  2015   57.0        2       任选
7   电工电子技术D4  2016   57.0        5       必修
45    机械制图D8  2017   58.0        2       限选
..       ...   ...    ...      ...      ...
82    机械制图D9  2015  100.0        3       限选
2   程序设计基础B3  2016  100.0        5       必修
23  程序设计基础A7  2015  100.0        4       任选
21    机械制图D1  2016  100.0        3       任选
77      体育B7  2019  100.0        5       必修

[97 rows x 5 columns]

In [21]:
# 重新读入文件
df = pd.read_csv('data/score.csv', encoding='gbk')
df

      subject  year  score  credits property
0    程序设计基础A6  2019   96.0        1       任选
1      机械制图D5  2018   79.0        4       任选
2    程序设计基础B3  2016  100.0        5       必修
3       微积分C1  2016   65.0        3       必修
4       微积分A8  2015   85.0        5       必修
..        ...   ...    ...      ...      ...
96     大学物理A6  2016   82.0        1       限选
97   程序设计基础D5  2016   62.0        2       限选
98      微积分D6  2019   86.0        3       限选
99   电工电子技术C2  2015   66.0        4       任选
100  程序设计基础B4  2015   61.0        4       限选

[101 rows x 5 columns]

In [22]:
# 处理缺失值
df = df.fillna(100) # 使用默认值填充确实项

### 2.3 函数应用
- 分组：groupby, 
- 数据透视表: pivot_table
- 聚合：agg，使用自定义函数：apply, map

类似于Excel操作

In [23]:
#分组和聚合
df.groupby('year')

for group in df.groupby('year'):
    print(group)

(2015,       subject  year  score  credits property
4       微积分A8  2015   85.0        5       必修
10     大学物理A2  2015   94.0        5       限选
16     机械制图B5  2015   91.0        3       限选
23   程序设计基础A7  2015  100.0        4       任选
26     机械制图A5  2015   73.0        5       限选
28   电工电子技术D6  2015   84.0        1       任选
30       体育A4  2015   82.0        4       任选
40       体育B4  2015   73.0        4       限选
43      微积分B6  2015   79.0        1       任选
49       体育A4  2015   70.0        1       任选
55      微积分B2  2015   89.0        2       限选
57   程序设计基础A5  2015   57.0        2       任选
61   程序设计基础C5  2015   95.0        1       必修
66     大学物理B2  2015   94.0        4       任选
69   电工电子技术C4  2015   76.0        5       必修
79     线性代数C5  2015   88.0        5       任选
82     机械制图D9  2015  100.0        3       限选
87       体育C7  2015   87.0        2       必修
99   电工电子技术C2  2015   66.0        4       任选
100  程序设计基础B4  2015   61.0        4       限选)
(2016,      subject  year  score  credits property
2   程序设计基础B3  2016  100.0        5       必修
3      微积分C1  2016   65.0        3       必修
7   电工电子技术D4  2016   57.0        5       必修
12    大学物理A1  2016   98.0        2       任选
17      体育B2  2016   82.0        2       必修
21    机械制图D1  2016  100.0        3       任选
25  程序设计基础A9  2016   68.0        2       限选
36  程序设计基础B2  2016   68.0        5       任选
39     微积分C4  2016   80.0        4       必修
65     微积分A4  2016   74.0        4       必修
67  电工电子技术A6  2016   74.0        5       必修
71  程序设计基础D5  2016   55.0        3       限选
78  程序设计基础B6  2016   80.0        4       限选
86     微积分C5  2016   56.0        5       任选
90  程序设计基础B3  2016  100.0        4       限选
91  电工电子技术C6  2016   67.0        1       限选
92  程序设计基础C4  2016   69.0        5       限选
96    大学物理A6  2016   82.0        1       限选
97  程序设计基础D5  2016   62.0        2       限选)
(2017,      subject  year  score  credits property
6     机械制图B4  2017   62.0        3       限选
11  程序设计基础A8  2017   97.0        4       限选
18     微积分D8  2017   77.0        2       限选
19    机械制图D2  2017   86.0        1       限选
29      体育B6  2017   75.0        4       任选
42  电工电子技术D4  2017   84.0        5       限选
45    机械制图D8  2017   58.0        2       限选
48  程序设计基础A9  2017   67.0        5       限选
64    大学物理C6  2017   94.0        5       必修
72      体育C3  2017   85.0        2       必修
73    线性代数D5  2017   72.0        5       限选
74     微积分B4  2017   95.0        1       必修
84    线性代数C9  2017   65.0        5       必修
85    线性代数A4  2017   87.0        5       限选
95      体育C6  2017   66.0        4       任选)
(2018,      subject  year  score  credits property
1     机械制图D5  2018   79.0        4       任选
20    线性代数D6  2018   74.0        2       必修
24      体育C2  2018   99.0        2       限选
34  电工电子技术B3  2018   87.0        5       必修
37    大学物理B3  2018  100.0        3       必修
41  电工电子技术C4  2018   77.0        5       必修
50    大学物理D2  2018   69.0        4       必修
52    大学物理C6  2018   93.0        1       必修
63    线性代数D7  2018  100.0        4       任选
68    机械制图B3  2018  100.0        3       任选
70  电工电子技术D6  2018   58.0        1       必修
75     微积分D8  2018   89.0        3       限选
76  电工电子技术C8  2018   87.0        3       必修
83    线性代数C8  2018   72.0        4       限选
89    机械制图C7  2018   92.0        3       任选)
(2019,      subject  year  score  credits property
0   程序设计基础A6  2019   96.0        1       任选
8   电工电子技术C6  2019   89.0        2       任选
13     微积分C3  2019   80.0        3       任选
14  程序设计基础D4  2019   61.0        5       任选
27  程序设计基础B5  2019   88.0        4       任选
32    线性代数B6  2019   63.0        5       限选
33  电工电子技术A3  2019   76.0        1       限选
38    线性代数A3  2019  100.0        1       限选
44    机械制图C4  2019   80.0        5       限选
46    线性代数B1  2019   80.0        1       限选
47    线性代数B4  2019   86.0        1       限选
53     微积分C4  2019   60.0        3       必修
54    机械制图B3  2019  100.0        4       必修
56    机械制图D6  2019   82.0        2       必修
77      体育B7  2019  100.0        5       必修
80    大学物理C2  2019   97.0        3       必修
93    线性代数C5  2019   60.0        1       限选
94      体育A7  2019   67.0        3       限选
98     微积分D6  2019   86.0        3       限选)
(2020,      subject  year  score  credits property
5       体育A2  2020   86.0        2       必修
9   电工电子技术C7  2020  100.0        5       必修
15    机械制图D8  2020   66.0        5       任选
22      体育D7  2020   98.0        1       任选
31    线性代数B1  2020   87.0        5       限选
35    大学物理C3  2020   77.0        3       必修
51     微积分C2  2020  100.0        1       任选
58      体育C5  2020   90.0        1       任选
59  电工电子技术A8  2020   64.0        1       必修
60  电工电子技术B3  2020   95.0        4       任选
62  程序设计基础C7  2020   99.0        5       任选
81    线性代数D3  2020   81.0        1       限选
88     微积分A6  2020   59.0        4       限选)

In [24]:
#显示其中一个分组
df.groupby('year').get_group(2020)
''

''

In [25]:
import numpy as np
# 按照年份统计平均分和学分数
df.groupby('year')['score','credits'].agg({"score": np.mean,"credits":np.sum})

C:\Users\gjx\AppData\Local\Temp\ipykernel_18976\1117411582.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby('year')['score','credits'].agg({"score": np.mean,"credits":np.sum})

          score  credits
year
2015  82.200000       65
2016  75.631579       65
2017  78.000000       53
2018  85.066667       47
2019  81.631579       53
2020  84.769231       38

In [26]:
#数据透视表
pd.pivot_table(df, index='year', columns='property', values='score',aggfunc=np.mean)

property         任选      必修         限选
year
2015      80.000000  85.750  83.000000
2016      80.500000  76.000  72.875000
2017      70.500000  84.750  76.666667
2018      92.750000  80.625  86.666667
2019      82.800000  87.800  77.555556
2020      91.333333  81.750  75.666667

### 练习：
1. 在成绩表中加入GPA列
2. 计算加权GPA

score to GPA 
  -  90～100 GPA: 4.0
  -  85～89 GPA: 3.6
  -  80～84 GPA: 3.3
  -  77～80 GPA: 3.0 
  -  73～77 GPA: 2.6
  -  70～72 GPA: 2.3
  -  67～69 GPA: 2.0
  -  63～66 GPA: 1.6
  -  60～62 GPA: 1.3
  -    <60     GPA: 0

In [27]:
def score_to_gpa(score):
    if score >= 90:
        gpa = 4.0
    elif score >= 85:
        gpa = 3.6
    elif score >= 80:
        gpa = 3.3
    elif score >= 77:
        gpa = 3.0
    elif score >= 73:
        gpa = 2.6
    elif score >= 70:
        gpa = 2.3
    elif score >= 67:
        gpa = 2.0
    elif score >= 63:
        gpa = 1.6
    elif score >= 60:
        gpa = 1.3
    else:
        gpa = 0
    return gpa

score_to_gpa(87)

3.6

In [28]:
# 使用自定义函数：apply
df["gpa"] = df["score"].apply(score_to_gpa)
df

      subject  year  score  credits property  gpa
0    程序设计基础A6  2019   96.0        1       任选  4.0
1      机械制图D5  2018   79.0        4       任选  3.0
2    程序设计基础B3  2016  100.0        5       必修  4.0
3       微积分C1  2016   65.0        3       必修  1.6
4       微积分A8  2015   85.0        5       必修  3.6
..        ...   ...    ...      ...      ...  ...
96     大学物理A6  2016   82.0        1       限选  3.3
97   程序设计基础D5  2016   62.0        2       限选  1.3
98      微积分D6  2019   86.0        3       限选  3.6
99   电工电子技术C2  2015   66.0        4       任选  1.6
100  程序设计基础B4  2015   61.0        4       限选  1.3

[101 rows x 6 columns]

In [29]:
# 使用apply函数实现两列的加权平均
def wavg(group, avg_name, weight_name):
    d = group[avg_name]
    w = group[weight_name]
    return (d * w).sum() / w.sum()

GPA_year = df.groupby('year').apply(wavg, "gpa", "credits")
# GPA_year
df.groupby(['year','property']).apply(wavg, "gpa", "credits")

year  property
2015  任选          3.007692
      必修          3.246154
      限选          3.069231
2016  任选          2.000000
      必修          2.428571
      限选          2.322727
2017  任选          2.100000
      必修          3.015385
      限选          2.671875
2018  任选          3.714286
      必修          3.041667
      限选          3.111111
2019  任选          2.800000
      必修          3.441176
      限选          2.671429
2020  任选          3.294118
      必修          3.436364
      限选          2.130000
dtype: float64

### 2.3 数据合并

pd.merge(left, right, how, on)
- left, right 待合并的df
- on 根据哪个字段进行合并
- how 合并方式,默认使用的inner。how包括left、right、inner、outer
![](img/merge.png)

In [30]:
adf = pd.DataFrame(
    {'x1': ['A', 'B', 'C'],
     'x2': [1, 2, 3]}
                  )

adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [31]:
bdf = pd.DataFrame(
    {'x1': ['A', 'B', 'D'],
     'x3': ['T', 'F', 'T']}
                  )

bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [32]:
df1 = pd.merge(adf, bdf, how='left', on='x1')
df1

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [33]:
df2 = pd.merge(adf, bdf, how='right', on='x1')
df2

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [34]:
df3 = pd.merge(adf, bdf, how='inner', on='x1')
df3

  x1  x2 x3
0  A   1  T
1  B   2  F

In [35]:
df4 = pd.merge(adf, bdf, how='outer', on='x1')
df4

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

**同构数据合并**


字段相同的dataframe合并

pd.concat([df1,df2])  将df1和df2合并

In [36]:
import pandas as pd

df1 = pd.read_csv('data/auto-mpg1.csv')
df1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,15.0,6,258,110,3730,19.0,75,1,amc matador
1,18.0,6,225,95,3785,19.0,75,1,plymouth fury
2,21.0,6,231,110,3039,15.0,75,1,buick skyhawk
3,20.0,8,262,110,3221,13.5,75,1,chevrolet monza 2+2
4,13.0,8,302,129,3169,12.0,75,1,ford mustang ii
...,...,...,...,...,...,...,...,...,...
231,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
232,44.0,4,97,52,2130,24.6,82,2,vw pickup
233,32.0,4,135,84,2295,11.6,82,1,dodge rampage
234,28.0,4,120,79,2625,18.6,82,1,ford ranger
235,31.0,4,119,82,2720,19.4,82,1,chevy s-10

In [37]:
df2 = pd.read_csv('data/auto-mpg2.csv')
df2

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
191,22.0,6,225.0,100,3233,15.4,76,1,plymouth valiant
192,22.0,6,250.0,105,3353,14.5,76,1,chevrolet nova
193,24.0,6,200.0,81,3012,17.6,76,1,ford maverick
194,22.5,6,232.0,90,3085,17.6,76,1,amc hornet
195,29.0,4,85.0,52,2035,22.2,76,1,chevrolet chevette

In [38]:
df3 = pd.concat([df1, df2])
df3

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,15.0,6,258.0,110,3730,19.0,75,1,amc matador
1,18.0,6,225.0,95,3785,19.0,75,1,plymouth fury
2,21.0,6,231.0,110,3039,15.0,75,1,buick skyhawk
3,20.0,8,262.0,110,3221,13.5,75,1,chevrolet monza 2+2
4,13.0,8,302.0,129,3169,12.0,75,1,ford mustang ii
...,...,...,...,...,...,...,...,...,...
191,22.0,6,225.0,100,3233,15.4,76,1,plymouth valiant
192,22.0,6,250.0,105,3353,14.5,76,1,chevrolet nova
193,24.0,6,200.0,81,3012,17.6,76,1,ford maverick
194,22.5,6,232.0,90,3085,17.6,76,1,amc hornet
195,29.0,4,85.0,52,2035,22.2,76,1,chevrolet chevette

### 2.4 DataFrame中有关时间变量的操作
 pd.to_datetime() 可将日期转化为datetime类型的数据，该函数可传入
- 单个的日期
- 也可以是日期序列

In [39]:
dates = ['2020.1.1', '2020 1.1', '2020 1 1', 
         '2020 1-1', '2020-1 1', '2020-1-1',
         '2020/1/1', '1.1.2020', '1.1 2020',
         '1 1 2020', '1 1-2020', '1-1 2020',
         '1-1-2020', '1/1/2020', '20200101', '2020.0101']

In [40]:
pd.to_datetime('1.1.2020')

Timestamp('2020-01-01 00:00:00')

In [41]:
#需要将数据转化为datatime的类型
pd.to_datetime(dates)

DatetimeIndex(['2020-01-01', '2020-01-01', '2020-01-01', '2020-01-01',
               '2020-01-01', '2020-01-01', '2020-01-01', '2020-01-01',
               '2020-01-01', '2020-01-01', '2020-01-01', '2020-01-01',
               '2020-01-01', '2020-01-01', '2020-01-01', '2020-01-01'],
              dtype='datetime64[ns]', freq=None)

#### Python Library `datetime`

In [10]:
import datetime as dt
t0=dt.datetime.now()
t0

datetime.datetime(2023, 12, 13, 3, 29, 4, 46850)

In [12]:
t0.strftime('%Y-%m-%d')

'2023-12-13'

In [13]:
t0.strftime('%m-%d-%Y')

'12-13-2023'

In [16]:
t0.strftime('%H:%M:%S')

'03:29:04'

In [17]:
t0.strftime('%Y-%B-%d %m-%d-%Y')

'2023-December-13 12-13-2023'

### 提取出时间/日期的属性
处理时间序列场景
- 求某个日期对应的星期数(2020-05-04是第几周)
- 判断一个星期是周几(2020-05-04是周几)
- 判断某一日期是第几个季度(2020-05-04是第几个季度)

当dataframe中的时间列(本数据中的Date列)已转为datetime类型数据，仅需调用 **.dt** 接口就可以提供常见的属性


|.dt的属性|功能|
|:---|:---|
|year|年份|
|month| 月份 |
|day|日|
|hour|时|
|minute|分|
|second|秒|
|date|日期|
|time|时间|
|dayofyear|一年中的第几天|
|weekday|一周中的第几天，0对应周一|
|weekday_name|周几的名称，周一Monday|
|quarter|处于第几个季度|

这里重新导入数据，

In [42]:
import pandas as pd

df = pd.read_csv('data/aapl.csv')
df

          Date    Open    High     Low   Close    Volume
0     7-Jul-17  142.90  144.75  142.90  144.18  19201712
1     6-Jul-17  143.02  143.50  142.41  142.73  24128782
2     5-Jul-17  143.69  144.79  142.72  144.09  21569557
3     3-Jul-17  144.88  145.30  143.10  143.50  14277848
4    30-Jun-17  144.45  144.96  143.78  144.02  23024107
..         ...     ...     ...     ...     ...       ...
246  15-Jul-16   98.92   99.30   98.50   98.78  30136990
247  14-Jul-16   97.39   98.99   97.32   98.79  38918997
248  13-Jul-16   97.41   97.67   96.84   96.87  25892171
249  12-Jul-16   97.17   97.70   97.12   97.42  24167463
250  11-Jul-16   96.75   97.65   96.73   96.98  23794945

[251 rows x 6 columns]

In [43]:
#进行格式转换
df['Date'] = pd.to_datetime(df['Date'])

In [44]:
df.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume             int64
dtype: object

In [45]:
df['Date'].dt.dayofweek

0      4
1      3
2      2
3      0
4      4
      ..
246    4
247    3
248    2
249    1
250    0
Name: Date, Length: 251, dtype: int64

In [46]:
#在原数据中添加月份信息
df['month']=df['Date'].dt.month
df

          Date    Open    High     Low   Close    Volume  month
0   2017-07-07  142.90  144.75  142.90  144.18  19201712      7
1   2017-07-06  143.02  143.50  142.41  142.73  24128782      7
2   2017-07-05  143.69  144.79  142.72  144.09  21569557      7
3   2017-07-03  144.88  145.30  143.10  143.50  14277848      7
4   2017-06-30  144.45  144.96  143.78  144.02  23024107      6
..         ...     ...     ...     ...     ...       ...    ...
246 2016-07-15   98.92   99.30   98.50   98.78  30136990      7
247 2016-07-14   97.39   98.99   97.32   98.79  38918997      7
248 2016-07-13   97.41   97.67   96.84   96.87  25892171      7
249 2016-07-12   97.17   97.70   97.12   97.42  24167463      7
250 2016-07-11   96.75   97.65   96.73   96.98  23794945      7

[251 rows x 7 columns]

In [47]:
#原数据中添加月份名字
df['monthname']=df['Date'].dt.month_name()
df

          Date    Open    High     Low   Close    Volume  month monthname
0   2017-07-07  142.90  144.75  142.90  144.18  19201712      7      July
1   2017-07-06  143.02  143.50  142.41  142.73  24128782      7      July
2   2017-07-05  143.69  144.79  142.72  144.09  21569557      7      July
3   2017-07-03  144.88  145.30  143.10  143.50  14277848      7      July
4   2017-06-30  144.45  144.96  143.78  144.02  23024107      6      June
..         ...     ...     ...     ...     ...       ...    ...       ...
246 2016-07-15   98.92   99.30   98.50   98.78  30136990      7      July
247 2016-07-14   97.39   98.99   97.32   98.79  38918997      7      July
248 2016-07-13   97.41   97.67   96.84   96.87  25892171      7      July
249 2016-07-12   97.17   97.70   97.12   97.42  24167463      7      July
250 2016-07-11   96.75   97.65   96.73   96.98  23794945      7      July

[251 rows x 8 columns]

In [48]:
#星期几
df['dayname']=df['Date'].dt.day_name()
df

,Date,Open,High,Low,Close,Volume,month,monthname,dayname
0,2017-07-07,142.90,144.75,142.90,144.18,19201712,7,July,Friday
1,2017-07-06,143.02,143.50,142.41,142.73,24128782,7,July,Thursday
2,2017-07-05,143.69,144.79,142.72,144.09,21569557,7,July,Wednesday
3,2017-07-03,144.88,145.30,143.10,143.50,14277848,7,July,Monday
4,2017-06-30,144.45,144.96,143.78,144.02,23024107,6,June,Friday
...,...,...,...,...,...,...,...,...,...
246,2016-07-15,98.92,99.30,98.50,98.78,30136990,7,July,Friday
247,2016-07-14,97.39,98.99,97.32,98.79,38918997,7,July,Thursday
248,2016-07-13,97.41,97.67,96.84,96.87,25892171,7,July,Wednesday
249,2016-07-12,97.17,97.70,97.12,97.42,24167463,7,July,Tuesday
250,2016-07-11,96.75,97.65,96.73,96.98,23794945,7,July,Monday

### 时间序列的索引
时间序列索引和Pandas普通索引类似，

大多数操作也可以使用 ``df.loc[index, columns]`` 选取数据,


不过在使用df.loc之前需要先将**日期列设置为行索引**

```
df.set_index('Date', inplace=True)
df.sort_index(inplace=True)
```

In [49]:
df.set_index('Date', inplace=True)
df.head()

,Open,High,Low,Close,Volume,month,monthname,dayname
Date,,,,,,,,
2017-07-07,142.90,144.75,142.90,144.18,19201712,7,July,Friday
2017-07-06,143.02,143.50,142.41,142.73,24128782,7,July,Thursday
2017-07-05,143.69,144.79,142.72,144.09,21569557,7,July,Wednesday
2017-07-03,144.88,145.30,143.10,143.50,14277848,7,July,Monday
2017-06-30,144.45,144.96,143.78,144.02,23024107,6,June,Friday

In [50]:
df.loc["2016-07":"2017-05"]

C:\Users\gjx\AppData\Local\Temp\ipykernel_18976\502154927.py:1: FutureWarning: Value based partial slicing on non-monotonic DatetimeIndexes with non-existing keys is deprecated and will raise a KeyError in a future Version.
  df.loc["2016-07":"2017-05"]

,Open,High,Low,Close,Volume,month,monthname,dayname
Date,,,,,,,,
2017-05-31,153.97,154.17,152.38,152.76,24451164,5,May,Wednesday
2017-05-30,153.42,154.43,153.33,153.67,20126851,5,May,Tuesday
2017-05-26,154.00,154.24,153.31,153.61,21927637,5,May,Friday
2017-05-25,153.73,154.35,153.03,153.87,19235598,5,May,Thursday
2017-05-24,153.84,154.17,152.67,153.34,19219154,5,May,Wednesday
...,...,...,...,...,...,...,...,...
2016-07-15,98.92,99.30,98.50,98.78,30136990,7,July,Friday
2016-07-14,97.39,98.99,97.32,98.79,38918997,7,July,Thursday
2016-07-13,97.41,97.67,96.84,96.87,25892171,7,July,Wednesday
2016-07-12,97.17,97.70,97.12,97.42,24167463,7,July,Tuesday
2016-07-11,96.75,97.65,96.73,96.98,23794945,7,July,Monday

In [51]:
#选取某一年
df.loc['2016',]

,Open,High,Low,Close,Volume,month,monthname,dayname
Date,,,,,,,,
2016-12-30,116.65,117.20,115.43,115.82,30586265,12,December,Friday
2016-12-29,116.45,117.11,116.40,116.73,15039519,12,December,Thursday
2016-12-28,117.52,118.02,116.20,116.76,20905892,12,December,Wednesday
2016-12-27,116.52,117.80,116.49,117.26,18296855,12,December,Tuesday
2016-12-23,115.59,116.52,115.59,116.52,14249484,12,December,Friday
...,...,...,...,...,...,...,...,...
2016-07-15,98.92,99.30,98.50,98.78,30136990,7,July,Friday
2016-07-14,97.39,98.99,97.32,98.79,38918997,7,July,Thursday
2016-07-13,97.41,97.67,96.84,96.87,25892171,7,July,Wednesday
2016-07-12,97.17,97.70,97.12,97.42,24167463,7,July,Tuesday
2016-07-11,96.75,97.65,96.73,96.98,23794945,7,July,Monday

In [52]:
#选取某一年的某几列数据
df.loc['2016',['High', 'Low']]

              High     Low
Date
2016-12-30  117.20  115.43
2016-12-29  117.11  116.40
2016-12-28  118.02  116.20
2016-12-27  117.80  116.49
2016-12-23  116.52  115.59
...            ...     ...
2016-07-15   99.30   98.50
2016-07-14   98.99   97.32
2016-07-13   97.67   96.84
2016-07-12   97.70   97.12
2016-07-11   97.65   96.73

[122 rows x 2 columns]

In [53]:
#选取某一年某一月的数据
df.loc['2017-01', ]

,Open,High,Low,Close,Volume,month,monthname,dayname
Date,,,,,,,,
2017-01-31,121.15,121.39,120.62,121.35,49200993,1,January,Tuesday
2017-01-30,120.93,121.63,120.66,121.63,30377503,1,January,Monday
2017-01-27,122.14,122.35,121.60,121.95,20562944,1,January,Friday
2017-01-26,121.67,122.44,121.60,121.94,26337576,1,January,Thursday
2017-01-25,120.42,122.10,120.28,121.88,32586673,1,January,Wednesday
2017-01-24,119.55,120.10,119.50,119.97,23211038,1,January,Tuesday
2017-01-23,120.00,120.81,119.77,120.08,22050218,1,January,Monday
2017-01-20,120.45,120.45,119.73,120.00,32597892,1,January,Friday
2017-01-19,119.40,120.09,119.37,119.78,25597291,1,January,Thursday
2017-01-18,120.00,120.50,119.71,119.99,23712961,1,January,Wednesday
2017-01-17,118.34,120.24,118.22,120.00,34439843,1,January,Tuesday
2017-01-13,119.11,119.62,118.81,119.04,26111948,1,January,Friday
2017-01-12,118.90,119.30,118.21,119.25,27086220,1,January,Thursday
2017-01-11,118.74,119.93,118.60,119.75,27588593,1,January,Wednesday
2017-01-10,118.77,119.38,118.30,119.11,24462051,1,January,Tuesday
2017-01-09,117.95,119.43,117.94,118.99,33561948,1,January,Monday
2017-01-06,116.78,118.16,116.47,117.91,31751900,1,January,Friday
2017-01-05,115.92,116.86,115.81,116.61,22193587,1,January,Thursday
2017-01-04,115.85,116.51,115.75,116.02,21118116,1,January,Wednesday
2017-01-03,115.80,116.33,114.76,116.15,28781865,1,January,Tuesday

In [54]:
#选取某一天的数据
df.loc['2017-01-20', :]

Open           120.45
High           120.45
Low            119.73
Close           120.0
Volume       32597892
month               1
monthname     January
dayname        Friday
Name: 2017-01-20 00:00:00, dtype: object

In [55]:
#选取某一时间区间
df.loc['2016-07':'2017-05', : ] #使用之前需要sort_index() inplace=True

C:\Users\gjx\AppData\Local\Temp\ipykernel_18976\4076331279.py:2: FutureWarning: Value based partial slicing on non-monotonic DatetimeIndexes with non-existing keys is deprecated and will raise a KeyError in a future Version.
  df.loc['2016-07':'2017-05', : ] #使用之前需要sort_index() inplace=True

,Open,High,Low,Close,Volume,month,monthname,dayname
Date,,,,,,,,
2017-05-31,153.97,154.17,152.38,152.76,24451164,5,May,Wednesday
2017-05-30,153.42,154.43,153.33,153.67,20126851,5,May,Tuesday
2017-05-26,154.00,154.24,153.31,153.61,21927637,5,May,Friday
2017-05-25,153.73,154.35,153.03,153.87,19235598,5,May,Thursday
2017-05-24,153.84,154.17,152.67,153.34,19219154,5,May,Wednesday
...,...,...,...,...,...,...,...,...
2016-07-15,98.92,99.30,98.50,98.78,30136990,7,July,Friday
2016-07-14,97.39,98.99,97.32,98.79,38918997,7,July,Thursday
2016-07-13,97.41,97.67,96.84,96.87,25892171,7,July,Wednesday
2016-07-12,97.17,97.70,97.12,97.42,24167463,7,July,Tuesday
2016-07-11,96.75,97.65,96.73,96.98,23794945,7,July,Monday

### date_range方法
pd.date_range(start, end, periods, freq)
- start: 开始日期字符串，如'2020-04-05'
- end: 结束日期字符串，如'2020-07-05'
- periods: 生成的时间点个数
- freq: 日期间隔

一般给定三个参数就能生成一段日期序列


符号 | D/B | W | M/Q/Y | BM/BQ/BY | MS/QS/YS | BMS/BQS/BYS | H | T | S
:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:
描述 | 日/工作日 | 周 | 月末 | 月/季/年末日 | 月/季/年末工作日 | 月/季/年初日 | 月/季/年初工作日 | 小时 | 分钟 |秒

In [56]:
#生成2020-04-05至2020-07-05之间的日期序列，每隔10天有一个日期

import pandas as pd

dates = pd.date_range(start='2020-04-05',
                      end='2020-07-05',
                      periods=10)#等分成十份
dates

DatetimeIndex(['2020-04-05 00:00:00', '2020-04-15 02:40:00',
               '2020-04-25 05:20:00', '2020-05-05 08:00:00',
               '2020-05-15 10:40:00', '2020-05-25 13:20:00',
               '2020-06-04 16:00:00', '2020-06-14 18:40:00',
               '2020-06-24 21:20:00', '2020-07-05 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [57]:
#生成2020-04-05至2020-07-05之间的日期序列，每隔10天有一个日期


dates2= pd.date_range(start='2020-04-05',
                      end='2020-07-05',
                      freq='10D')
dates2

DatetimeIndex(['2020-04-05', '2020-04-15', '2020-04-25', '2020-05-05',
               '2020-05-15', '2020-05-25', '2020-06-04', '2020-06-14',
               '2020-06-24', '2020-07-04'],
              dtype='datetime64[ns]', freq='10D')

### 重采样resample

``resample is a time-based groupby``

重采样就是基于时间的groupby操作，包括

- 降采样
- 升采样

### 降采样
课程中准备的aapl.csv是**日级数据**，如果想寻求**每季度**的平均收盘价，应该怎么操作？

从**日级**到**季度级别**，是**高频**到**低频**的**聚合操作**，其实就类似于groupby按照季度进行操作，用resample来写

In [5]:
df=pd.read_csv('data/aapl.csv')
df

          Date    Open    High     Low   Close    Volume
0     7-Jul-17  142.90  144.75  142.90  144.18  19201712
1     6-Jul-17  143.02  143.50  142.41  142.73  24128782
2     5-Jul-17  143.69  144.79  142.72  144.09  21569557
3     3-Jul-17  144.88  145.30  143.10  143.50  14277848
4    30-Jun-17  144.45  144.96  143.78  144.02  23024107
..         ...     ...     ...     ...     ...       ...
246  15-Jul-16   98.92   99.30   98.50   98.78  30136990
247  14-Jul-16   97.39   98.99   97.32   98.79  38918997
248  13-Jul-16   97.41   97.67   96.84   96.87  25892171
249  12-Jul-16   97.17   97.70   97.12   97.42  24167463
250  11-Jul-16   96.75   97.65   96.73   96.98  23794945

[251 rows x 6 columns]

In [7]:
#每月成交量的均值
df['Date']=pd.to_datetime(df['Date'])
df.resample('M', on='Date').mean()

                  Open        High         Low       Close        Volume
Date
2016-07-31   99.422667  100.157333   98.948000   99.473333  3.646981e+07
2016-08-31  107.462609  108.140435  106.986522  107.665217  2.739689e+07
2016-09-30  110.673333  111.745238  109.807619  110.857143  4.617282e+07
2016-10-31  115.743810  116.388095  114.941429  115.707143  3.271020e+07
2016-11-30  110.098571  111.068095  108.988571  110.154286  3.432798e+07
2016-12-31  113.995238  115.025238  113.544762  114.335714  2.898913e+07
2017-01-31  119.093500  119.881000  118.785500  119.570000  2.816656e+07
2017-02-28  133.234737  134.161053  132.836842  133.713684  3.026150e+07
2017-03-31  140.361304  141.197826  139.708696  140.617826  2.443875e+07
2017-04-30  143.030000  143.597895  142.327368  142.886842  1.964758e+07
2017-05-31  151.965909  153.061364  151.108636  152.227727  2.972831e+07
2017-06-30  148.215000  149.088636  146.582727  147.831364  3.109900e+07
2017-07-31  143.622500  144.585000  142.782500  143.625000  1.979447e+07

In [8]:
#每周(工作日)收盘价的均值

df.resample('5B', on='Date')['Close'].mean()

Date
2016-07-11     97.7680
2016-07-18     99.5500
2016-07-25    101.1020
2016-08-01    105.9340
2016-08-08    108.2580
2016-08-15    109.3040
2016-08-22    107.9800
2016-08-29    106.6760
2016-09-05    106.1775
2016-09-12    111.1300
2016-09-19    113.6060
2016-09-26    113.0300
2016-10-03    113.3040
2016-10-10    116.8600
2016-10-17    117.1600
2016-10-24    115.9380
2016-10-31    111.0580
2016-11-07    109.7140
2016-11-14    108.5640
2016-11-21    111.6375
2016-11-28    110.5880
2016-12-05    111.2320
2016-12-12    115.0940
2016-12-19    116.6920
2016-12-26    116.6425
2017-01-02    116.6725
2017-01-09    119.2280
2017-01-16    119.9425
2017-01-23    121.1640
2017-01-30    125.8680
2017-02-06    131.6800
2017-02-13    134.9760
2017-02-20    136.7500
2017-02-27    138.4900
2017-03-06    139.1360
2017-03-13    139.8660
2017-03-20    140.8560
2017-03-27    143.2780
2017-04-03    143.8980
2017-04-10    141.9125
2017-04-17    141.6840
2017-04-24    143.8580
2017-05-01    147.3280
2017-05-08    154.0620
2017-05-15    153.4040
2017-05-22    153.7220
2017-05-29    153.7650
2017-06-05    153.5440
2017-06-12    144.7460
2017-06-19    145.8260
2017-06-26    144.6160
2017-07-03    143.6250
Freq: 5B, Name: Close, dtype: float64

## 相关学习资料


https://pandas.pydata.org/pandas-docs/version/0.22.0/10min.html